# Import Data from CSV

In [1]:
import pandas as pd
df = pd.read_csv('http://bit.ly/drinksbycountry')
df.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,Asia
1,Albania,89,132,54,4.9,Europe
2,Algeria,25,0,14,0.7,Africa
3,Andorra,245,138,312,12.4,Europe
4,Angola,217,57,45,5.9,Africa

# Describe Dataset

In [9]:
dfstats= df.describe()
dfstats

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
count,193.000000,193.000000,193.000000,193.000000
mean,106.160622,80.994819,49.450777,4.717098
std,101.143103,88.284312,79.697598,3.773298
min,0.000000,0.000000,0.000000,0.000000
25%,20.000000,4.000000,1.000000,1.300000
50%,76.000000,56.000000,8.000000,4.200000
75%,188.000000,128.000000,59.000000,7.200000
max,376.000000,438.000000,370.000000,14.400000

# column information

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

# Determine If DataFrame or Series

In [3]:
type(df)

pandas.core.frame.DataFrame

# Determine Data Type of a column

In [4]:
df.beer_servings.dtype

dtype('int64')

# Determine # of Rows and Columns in a DataFrame

In [10]:
df.shape

(193, 6)

# Determine Data Type for All Columns in a Dataframe

In [11]:
df.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 9.2+ KB

# Delete a Column

In [14]:
df.drop(['total_litres_of_pure_alcohol'], axis=1).head()
#could use tail instead of head.

       country  beer_servings  spirit_servings  wine_servings continent
0  Afghanistan              0                0              0      Asia
1      Albania             89              132             54    Europe
2      Algeria             25                0             14    Africa
3      Andorra            245              138            312    Europe
4       Angola            217               57             45    Africa

# Check is there is Null values in head (first 5 values)

In [16]:
df.isnull().head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False

# Check Sum of Null Values By Column

In [17]:
df.isnull().sum()

country                         0
beer_servings                   0
spirit_servings                 0
wine_servings                   0
total_litres_of_pure_alcohol    0
continent                       0
dtype: int64

# Groupby Continent based on Sum and Drop "total litres"

In [18]:
drop=df.groupby(['continent']).sum().drop(['total_litres_of_pure_alcohol'], axis=1)
drop

               beer_servings  spirit_servings  wine_servings
continent
Africa                  3258              866            862
Asia                    1630             2677            399
Europe                  8720             5965           6400
North America           3345             3812            564
Oceania                 1435              935            570
South America           2101             1377            749

In [20]:
mean4=df.groupby(['continent']).mean()
mean4

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
Africa,61.471698,16.339623,16.264151,3.007547
Asia,37.045455,60.840909,9.068182,2.170455
Europe,193.777778,132.555556,142.222222,8.617778
North America,145.434783,165.739130,24.521739,5.995652
Oceania,89.687500,58.437500,35.625000,3.381250
South America,175.083333,114.750000,62.416667,6.308333

In [21]:
(df.beer_servings>50.00).head()

0    False
1     True
2    False
3     True
4     True
Name: beer_servings, dtype: bool

In [23]:
gt50 = df.loc[df['beer_servings']>50]
gt50.shape

(114, 6)

In [ ]:
mean.to_csv ('meandrink2.csv', index = True, header=True)

In [ ]:
mean.drop(['index_col'], axis=1)

In [ ]:
mean4=df.groupby(['continent']).mean()

In [ ]:
mean4

In [ ]:
mean5 = mean4.reset_index()

In [ ]:
mean5

In [ ]:
df.describe()

# Create Boolean Conditions for Beer, Spirit, Wine Exceeding Average

In [ ]:
df["BeerLover"]=(df['beer_servings'] > 100)
df['SpiritLover']=(df['spirit_servings']> 80)
df['WineLover']=(df['wine_servings']> 50)
df.head()

In [ ]:
df.beer_servings.dtype

# Count total number of True/False

In [ ]:
df.SpiritLover.value_counts()

# Isolate Beer Condition to Create Index

In [ ]:
beertrue=df['BeerLover']
beertrue

# Create DataFrame to Only Include True Condition for Beer

In [ ]:
beeronly=df[beertrue]
beeronly

# Groupby Beer Condition by Continent

In [ ]:
beergb = beeronly.groupby(['continent']).mean()
beergb

# Plot Only Binary Conditions

# Isolate a DataFrame Column to a Series

In [ ]:
type(df.continent)

In [ ]:
type(df["beer_servings"])

# Create a new series using concatenate

In [ ]:
df['nationcont'] = df.country+df.continent

In [ ]:
type(df["nationcont"])

In [ ]:
type(df.nationcont)

In [ ]:
df.head()

In [ ]:
df.info()

# Demonstrate the difference Between Inplace =True/False

In [ ]:
df.drop('nationcont', axis=1) #inplace=False

In [ ]:
df.info()

In [ ]:
df.drop('nationcont', axis=1, inplace=True)

# 'Inplace=True' will permanently remove column

In [ ]:
df.info()

# Drop the first five rows of a dataframe

In [ ]:
df.drop([0,1,2,3,4], axis=0).head()

In [ ]:
df.shape

In [ ]:
df.drop([0,1,2,3,4], axis=0, inplace=True)

In [ ]:
df.shape

# Sort a dataframe column

In [ ]:
df.sort_values('continent', ascending=True).head()

In [ ]:
df.sort_values('beer_servings', ascending = False).head()

In [ ]:
df.sort_values(['wine_servings'], ascending = False)

In [ ]:
df.loc[df['country']=='Lebanon']

In [ ]:
df.loc[[94]]

In [ ]:
df.iloc[[89]]

In [ ]:
df[40:90]

In [ ]:
df['sumal'] = df.beer_servings + df.spirit_servings + df.wine_servings

In [ ]:
df.head()

In [ ]:
df.continent.value_counts()